{
    "ocr": {
        "title": "end-to-end OCR model",
        "type": "CS",
        "link": "",
        "description": [{
            "type": "text",
            "content": "Combined ABC-Net and Transformer architectures for create a model for scene text recognition of arbitrary shapes."
        }],
        "tools": "Python (PyTorch), Linux, Docker"
    },
    "geolocation": {
        "title": "image geolocation",
        "type": "CS",
        "link": "",
        "description": [{
            "type": "text",
            "content": "Contributed to constructing a solution for image geolocation given a drone-shot scene image in Korea (implemented text-filtering algorithms to post-process outputs of STR models / utilized Google+Naver+Kakao Map APIs for geocoding and generating test data / used OpenCV to analyze map images and localize geographical coordinates)."
        }],
        "tools": "Python (OpenCV), Javascript"
    },
    "plugin": {
        "title": "accessible web browser plugin",
        "type": "CS",
        "link": "",
        "media": [{
            "type": "image",
            "url": "CS/plugin.png"
        }],
        "description": [{
            "type": "text",
            "content": "Chrome browser extension to detect and highlight web page elements that are inaccessible to users with visual and audio impairment, as outlined by the ADA Website Compliance Guidelines."
        }],
        "tools": "Javascript"
    },
    "tokitalk": {
        "title": "tokitalk",
        "type": "CS",
        "link": "",
        "media": [{
            "type": "image",
            "url": "CS/tokitalk.png"
        }],
        "description": [{
                "type": "text",
                "content": "In the summer following my sophomore year of college, I interned at Hancom Robotics, which is tech a company based in Korea. Hancom develops multiple types of robots, and the one I worked with most closely during my time was this one named \"Toki\"."
            },
            {
                "type": "text",
                "content": "Toki is a child-sized robot that is used in households and schools to practice English with students through dialogues, quizzes, and storybook telling. When practicing an English dialogue, Toki puts on these glasses and asks a question and displays it on the left lens, and waits for the student to respond while displaying the correct answer on the right lens. "
            },
            {
                "type": "text",
                "content": "Something special about Toki is that not only does it come with an English curriculum that consists of dialogues student can practice, but it also allows teachers to create their own additional dialogues and quizzes and send them to the server. This is where my work comes in."
            },
            {
                "type": "text",
                "content": "I created a Spring Web MVC Project that provides an interface for teachers to upload the Excel files they create."
            }

        ],
        "tools": "Spring (Java), MySQL"
    },
    "toki-bluetooth-app": {
        "title": "toki bluetooth app",
        "type": "CS",
        "link": "",
        "media": [{
                "type": "image",
                "url": "CS/bluetooth.jpg"
            },
            {
                "type": "image",
                "url": "CS/bluetooth.jpg"
            }
        ],
        "description": [{
                "type": "text",
                "content": "I created a server for an educational home robot, where English teachers can upload and customize curriculum for use with the robot."
            }, {
                "type": "text",
                "content": "Toki is an educational robot developed by Hancom Robotics, where I interned the summer after my sophomore year. It teaches English to pre - school and elementary school students through verbal dialogue exchanges and quizzes. It is used at home for daily conversation practice, as well as in schools and English academies."
            },
            {
                "type": "text",
                "content": "A frustrating problem that we encountered when testing Toki at various academies was that in classroom environments where there were numerous students conversing with each other at once, Toki often had a difficult time discerning the voice of the student that it was speaking with. After much contemplation and discussion, we eventually decided to implement the functionality to connect a bluetooth headset with Toki so that students can speak into a microphone. This would allow Toki to pick up the individual student's voice better, and the student would also be able to hear Toki more clearly when there is a lot of background noise. "
            },

            {
                "type": "text",
                "content": "I utilized Android Studio to develop an application for the robot that has the following features:"
            },
            {
                "type": "text",
                "content": "1. Turn bluetooth functionality on and off"
            },
            {
                "type": "text",
                "content": "2. Make Toki discoverable to nearby bluetooth devices"
            },
            {
                "type": "text",
                "content": "3. Display all nearby bluetooth headsets"
            },
            {
                "type": "text",
                "content": "4. Display all paired devices"
            },
            {
                "type": "text",
                "content": "5. Allow the user to pair and connect to nearby devices"
            },
            {
                "type": "text",
                "content": "6. Allow the user to connect to already paired devices"
            },
            {
                "type": "text",
                "content": "7. Disconnect with devices"
            },
            {
                "type": "text",
                "content": "8. Unpair from devices"
            }
        ],
        "tools": "Android Studio (Java)"
    },
    "tigerride": {
        "title": "tigerride",
        "type": "CS",
        "link": "",
        "media": [{
            "type": "image",
            "url": "CS/tigerride.png"
        }],
        "description": [{
                "type": "text",
                "content": "Tigerride is a web application to streamline the process of students sharing rideshare services to and from campus in order minimize travel costs and search time."
            },
            {
                "type": "text",
                "content": "At the beginning and end of every break, numerous Princeton students look for people to split Uber/Lyft rides with to nearby airports, because the costs are quite expensive. This website, which I developed with a team of three fellow students, matches people who are looking to travel to the same destination around the same time frame. I was mostly in charge of the front-end development."
            }
        ],
        "tools": "Django (Python, Javascript), Postgres, Heroku"
    },
    "alpaca": {
        "title": "alpaca game",
        "type": "CS",
        "link": "",
        "media": [{
                "type": "image",
                "url": "CS/alpaca0.png"
            },
            {
                "type": "image",
                "url": "CS/alpaca1.png"
            }
        ],
        "description": [{
                "type": "text",
                "content": "A game where the user becomes an alpaca and travels the world to learn about different gender identities and sexualities that are specific to certain cultures."
            },
            {
                "type": "text",
                "content": "<a href=\"../alpaca.html\">learn more</a>"
            }
        ],
        "tools": "C# (Unity), Autodesk Maya"
    }
}